OdRxModule.moduleName
\details
Declares the method returning the module name for the rx-module instance.
\remarks
It is the pure virtual method that does not have an implementation. You must redefine it in the derived class.

OdRxModule.deleteModule
\details
Declares the method deleting (unloading) the rx-module.
\remarks
It is the pure virtual method that does not have an implementation. You must redefine it in the derived class.

OdRxModule.sysData
\details
Declares the method returning the system data for the rx-module instance.
\remarks
It is the pure virtual method that does not have an implementation. You must redefine it in the derived class.